xy660/NexusEJS/src/NexusEJS-Firmware/src/ESP32Driver/ESP32_Driver_Serial.cpp
#ifdef ESP32_PLATFORM

#include <ESP32Driver/Esp32Driver.h>

#if ESP32_SERIALAPI_ENABLED


//暂定使用esp-idf的原生串口api，可以和println&c的printf使用的隔离开
#include "driver/uart.h"
#include "freertos/queue.h"
#include <unordered_map>
#include <vector>

#include "BuildinStdlib.h"
#include "GC.h"
#include "VM.h"

#pragma region serial_support

#define SERIAL_BUFFER_SIZE 1024
#define SERIAL_DEFAULT_QUEUE_SIZE 128
#define SERIAL_READ_TIMEOUT_MS 100
#define SERIAL_WRITE_TIMEOUT_MS 1000

#ifndef UART_SCLK_DEFAULT
#define UART_SCLK_DEFAULT UART_SCLK_APB
#endif

// 存储Serial实例
static std::unordered_map<uint32_t, uart_port_t> serialInstances;
static std::unordered_map<uint32_t, QueueHandle_t> serialQueues;
static uint32_t serialInstanceIdSeed = 1;

// 串口配置结构
/*
struct SerialConfig {
    int baud_rate;
    uart_word_length_t data_bits;
    uart_parity_t parity;
    uart_stop_bits_t stop_bits;
    uart_hw_flowcontrol_t flow_control;
};
*/

// 合并串口初始化函数
bool serial_port_init(uart_port_t uart_num, int tx_pin, int rx_pin, 
                      int baud_rate, uart_word_length_t data_bits,
                      uart_parity_t parity, uart_stop_bits_t stop_bits,
                      uart_hw_flowcontrol_t flow_control) {
    
    uart_config_t uart_config = {
        .baud_rate = baud_rate,
        .data_bits = data_bits,
        .parity = parity,
        .stop_bits = stop_bits,
        .flow_ctrl = flow_control,
        .rx_flow_ctrl_thresh = 122,
        .source_clk = UART_SCLK_DEFAULT,
    };
    
    // 先检查UART是否已安装
    bool driver_installed = uart_is_driver_installed(uart_num);
    
    if (!driver_installed) {
        // 安装驱动
        if(uart_driver_install(uart_num, SERIAL_BUFFER_SIZE * 2, 
                                        SERIAL_BUFFER_SIZE * 2, SERIAL_DEFAULT_QUEUE_SIZE, 
                                        nullptr, 0) != ESP_OK){
            return false;
        }
    } else {
        // 如果已安装，先卸载再重新安装
        uart_driver_delete(uart_num);
        if(uart_driver_install(uart_num, SERIAL_BUFFER_SIZE * 2, 
                                        SERIAL_BUFFER_SIZE * 2, SERIAL_DEFAULT_QUEUE_SIZE, 
                                        nullptr, 0) != ESP_OK){
            return false;
        }
    }
    
    if(uart_param_config(uart_num, &uart_config) != ESP_OK){
        return false;
    }
    
    // 设置引脚
    if(uart_set_pin(uart_num, tx_pin, rx_pin, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE) != ESP_OK){
        return false;
    }
    
    return true;
}

// 写入数据
esp_err_t serial_write(uart_port_t uart_num, const uint8_t* data, size_t len) {
    int bytes_written = uart_write_bytes(uart_num, (const char*)data, len);
    if (bytes_written < 0) {
        return ESP_FAIL;
    }
    return ESP_OK;
}

// 读取数据
int serial_read(uart_port_t uart_num, uint8_t* data, size_t len, int timeout_ms) {
    return uart_read_bytes(uart_num, data, len, pdMS_TO_TICKS(timeout_ms));
}

// 获取可读字节数
int serial_available(uart_port_t uart_num) {
    size_t available = 0;
    if(uart_get_buffered_data_len(uart_num, &available) != ESP_OK);
    return available;
}

// 清理串口
esp_err_t serial_delete(uart_port_t uart_num) {
    return uart_driver_delete(uart_num);
}

// 刷新输出缓冲区
esp_err_t serial_flush(uart_port_t uart_num) {
    return uart_wait_tx_done(uart_num, pdMS_TO_TICKS(SERIAL_WRITE_TIMEOUT_MS));
}

std::unordered_map<std::string, VariableValue> SerialObjectFuncTemplate;

void Serial_ObjectFuncTemplateInit() {
    // 析构函数
    SerialObjectFuncTemplate["finalize"] = VM::CreateSystemFunc(
        0,
        [](std::vector<VariableValue>& args, VMObject* thisValue,
           VMWorker* currentWorker) -> VariableValue {
            uint32_t instanceId =
                (uint32_t)thisValue->implement.objectImpl["_id"].content.number;

            printf("Serial.finalize id=%d\n",instanceId);

            if (serialInstances.find(instanceId) != serialInstances.end()) {
                serial_delete(serialInstances[instanceId]);
                serialInstances.erase(instanceId);
            }
            
            if (serialQueues.find(instanceId) != serialQueues.end()) {
                vQueueDelete(serialQueues[instanceId]);
                serialQueues.erase(instanceId);
            }

            return CreateBooleanVariable(true);
        });

    // 写入数据
    SerialObjectFuncTemplate["write"] = VM::CreateSystemFunc(
        1,
        [](std::vector<VariableValue>& args, VMObject* thisValue,
           VMWorker* currentWorker) -> VariableValue {
            
            uint32_t instanceId =
                (uint32_t)thisValue->implement.objectImpl["_id"].content.number;
            uart_port_t uart_num =
                (uart_port_t)thisValue->implement.objectImpl["_port"].content.number;

            if (serialInstances.find(instanceId) == serialInstances.end()) {
                currentWorker->ThrowError(
                    "Serial instance not initialized or already released");
                return VariableValue();
            }

            // 处理数据参数
            esp_err_t ret = ESP_OK;
            
            if (args[0].getContentType() == ValueType::NUM) {
                // 单个字节
                uint8_t data = (uint8_t)args[0].content.number;
                ret = serial_write(uart_num, &data, 1);
            } else if (args[0].getContentType() == ValueType::OBJECT) {
                // Buffer对象
                auto& obj = args[0].content.ref->implement.objectImpl;
                if (obj.find("bufid") != obj.end()) {
                    uint32_t bufid = obj["bufid"].content.number;
                    auto bufinfo = GetByteBufferInfo(bufid);
                    if (!bufinfo.data || bufinfo.length == 0) {
                        currentWorker->ThrowError("Invalid Buffer");
                        return VariableValue();
                    }

