xy660/NexusEJS/src/NexusEJS-Firmware/src/ESP32Driver/ESP32_Driver_Serial.cpp
                    ret = serial_write(uart_num, bufinfo.data, bufinfo.length);
                } else if (obj.find("string") != obj.end()) {
                    // 字符串对象
                    std::string str = obj["string"].content.ref->implement.stringImpl;
                    ret = serial_write(uart_num, (const uint8_t*)str.c_str(), str.length());
                } else {
                    currentWorker->ThrowError("Invalid data object");
                    return VariableValue();
                }
            } else if (args[0].getContentType() == ValueType::STRING) {
                // 字符串值
                std::string str = args[0].content.ref->implement.stringImpl;
                ret = serial_write(uart_num, (const uint8_t*)str.c_str(), str.length());
            } else {
                currentWorker->ThrowError("Data argument must be a number, string, or Buffer");
                return VariableValue();
            }

            return CreateBooleanVariable(ret == ESP_OK);
        });

    // 读取数据
    SerialObjectFuncTemplate["read"] = VM::CreateSystemFunc(
        2,
        [](std::vector<VariableValue>& args, VMObject* thisValue,
           VMWorker* currentWorker) -> VariableValue {
            
            if (args[0].getContentType() != ValueType::OBJECT ||
                args[1].getContentType() != ValueType::NUM) {
                currentWorker->ThrowError(
                    "Invalid argument type: expected (buffer, length)");
                return VariableValue();
            }

            auto bufid_it = args[0].content.ref->implement.objectImpl.find("bufid");
            if (bufid_it == args[0].content.ref->implement.objectImpl.end()) {
                currentWorker->ThrowError("Invalid buffer object");
                return VariableValue();
            }
            uint32_t bufid = (*bufid_it).second.content.number;

            auto buf_info = GetByteBufferInfo(bufid);

            size_t length = (size_t)args[1].content.number;
            int timeout = SERIAL_READ_TIMEOUT_MS;

            if (args.size() > 2 && args[2].getContentType() == ValueType::NUM) {
                timeout = (int)args[2].content.number;
            }

            if (length <= 0 || length > 4096) {
                currentWorker->ThrowError("Read length must be between 1 and 4096");
                return VariableValue();
            }

            if (!buf_info.data) {
                currentWorker->ThrowError("Invalid buffer object");
                return VariableValue();
            }

            if (buf_info.length < length) {
                currentWorker->ThrowError("Buffer size too small");
                return VariableValue();
            }

            uint32_t instanceId =
                (uint32_t)thisValue->implement.objectImpl["_id"].content.number;
            uart_port_t uart_num =
                (uart_port_t)thisValue->implement.objectImpl["_port"].content.number;

            if (serialInstances.find(instanceId) == serialInstances.end()) {
                currentWorker->ThrowError(
                    "Serial instance not initialized or already released");
                return VariableValue();
            }

            // 读取数据
            int bytes_read = serial_read(uart_num, buf_info.data, length, timeout);
            
            if (bytes_read < 0) {
                return CreateBooleanVariable(false);
            }

            // 返回实际读取的字节数
            return CreateNumberVariable((double)bytes_read);
        });

    // 读取字节
    SerialObjectFuncTemplate["readByte"] = VM::CreateSystemFunc(
        0,
        [](std::vector<VariableValue>& args, VMObject* thisValue,
           VMWorker* currentWorker) -> VariableValue {
            
            uint32_t instanceId =
                (uint32_t)thisValue->implement.objectImpl["_id"].content.number;
            uart_port_t uart_num =
                (uart_port_t)thisValue->implement.objectImpl["_port"].content.number;

            if (serialInstances.find(instanceId) == serialInstances.end()) {
                currentWorker->ThrowError(
                    "Serial instance not initialized or already released");
                return VariableValue();
            }

            uint8_t byte = 0;
            int bytes_read = serial_read(uart_num, &byte, 1, SERIAL_READ_TIMEOUT_MS);
            
            if (bytes_read <= 0) {
                return CreateNumberVariable(-1); // 返回-1表示无数据
            }

            return CreateNumberVariable((double)byte);
        });

    // 读取一行
    SerialObjectFuncTemplate["readLine"] = VM::CreateSystemFunc(
        DYNAMIC_ARGUMENT,
        [](std::vector<VariableValue>& args, VMObject* thisValue,
           VMWorker* currentWorker) -> VariableValue {
            
            uint32_t instanceId =
                (uint32_t)thisValue->implement.objectImpl["_id"].content.number;
            uart_port_t uart_num =
                (uart_port_t)thisValue->implement.objectImpl["_port"].content.number;

            if (serialInstances.find(instanceId) == serialInstances.end()) {
                currentWorker->ThrowError(
                    "Serial instance not initialized or already released");
                return VariableValue();
            }

            // 创建字符串缓冲区
            VMObject* strObj = currentWorker->VMInstance->currentGC->GC_NewObject(
                ValueType::STRING);
            std::string line = "";
            
            uint8_t byte = 0;
            int timeout = 100; // 每字节超时
            int line_timeout = 1000; // 行读取总超时
            if(args.size() > 0 && args[0].varType == ValueType::NUM){
                line_timeout = (int)args[0].content.number;
            }
            int start_time = xTaskGetTickCount() * portTICK_PERIOD_MS;
            
            while (true) {
                int bytes_read = serial_read(uart_num, &byte, 1, timeout);
                
                if (bytes_read > 0) {
                    if (byte == '\n') {
                        break;
                    } else if (byte != '\r') {
                        line += (char)byte;
                    }
                }
                
                // 检查超时
                if ((xTaskGetTickCount() * portTICK_PERIOD_MS - start_time) > line_timeout) {
                    break;
                }
                
                taskYIELD();
            }
            
            strObj->implement.stringImpl = line;
            return CreateReferenceVariable(strObj);
        });

    // 获取可读字节数
    SerialObjectFuncTemplate["available"] = VM::CreateSystemFunc(
        0,
        [](std::vector<VariableValue>& args, VMObject* thisValue,
           VMWorker* currentWorker) -> VariableValue {
            
