xy660/NexusEJS/src/NexusEJS-Firmware/src/ESP32Driver/ESP32_Driver_Serial.cpp
            uint32_t instanceId =
                (uint32_t)thisValue->implement.objectImpl["_id"].content.number;
            uart_port_t uart_num =
                (uart_port_t)thisValue->implement.objectImpl["_port"].content.number;

            if (serialInstances.find(instanceId) == serialInstances.end()) {
                currentWorker->ThrowError(
                    "Serial instance not initialized or already released");
                return VariableValue();
            }

            int available = serial_available(uart_num);
            return CreateNumberVariable((double)available);
        });

    // 刷新输出缓冲区
    SerialObjectFuncTemplate["flush"] = VM::CreateSystemFunc(
        0,
        [](std::vector<VariableValue>& args, VMObject* thisValue,
           VMWorker* currentWorker) -> VariableValue {
            
            uint32_t instanceId =
                (uint32_t)thisValue->implement.objectImpl["_id"].content.number;
            uart_port_t uart_num =
                (uart_port_t)thisValue->implement.objectImpl["_port"].content.number;

            if (serialInstances.find(instanceId) == serialInstances.end()) {
                currentWorker->ThrowError(
                    "Serial instance not initialized or already released");
                return VariableValue();
            }

            esp_err_t ret = serial_flush(uart_num);
            return CreateBooleanVariable(ret == ESP_OK);
        });

    // 清空输入缓冲区
    SerialObjectFuncTemplate["clear"] = VM::CreateSystemFunc(
        0,
        [](std::vector<VariableValue>& args, VMObject* thisValue,
           VMWorker* currentWorker) -> VariableValue {
            
            uint32_t instanceId =
                (uint32_t)thisValue->implement.objectImpl["_id"].content.number;
            uart_port_t uart_num =
                (uart_port_t)thisValue->implement.objectImpl["_port"].content.number;

            if (serialInstances.find(instanceId) == serialInstances.end()) {
                currentWorker->ThrowError(
                    "Serial instance not initialized or already released");
                return VariableValue();
            }

            ESP_ERROR_CHECK(uart_flush(uart_num));
            return CreateBooleanVariable(true);
        });

    // 设置串口参数
    SerialObjectFuncTemplate["setConfig"] = VM::CreateSystemFunc(
        4,
        [](std::vector<VariableValue>& args, VMObject* thisValue,
           VMWorker* currentWorker) -> VariableValue {
            
            if (args[0].getContentType() != ValueType::NUM ||
                args[1].getContentType() != ValueType::NUM ||
                args[2].getContentType() != ValueType::NUM ||
                args[3].getContentType() != ValueType::NUM) {
                currentWorker->ThrowError(
                    "Invalid argument type: expected (baudRate, dataBits, parity, stopBits)");
                return VariableValue();
            }

            uint32_t instanceId =
                (uint32_t)thisValue->implement.objectImpl["_id"].content.number;
            uart_port_t uart_num =
                (uart_port_t)thisValue->implement.objectImpl["_port"].content.number;

            if (serialInstances.find(instanceId) == serialInstances.end()) {
                currentWorker->ThrowError(
                    "Serial instance not initialized or already released");
                return VariableValue();
            }

            int baud_rate = (int)args[0].content.number;
            int data_bits = (int)args[1].content.number;
            int parity = (int)args[2].content.number;
            int stop_bits = (int)args[3].content.number;

            // 验证参数
            if (data_bits < 5 || data_bits > 8) {
                currentWorker->ThrowError("Data bits must be 5, 6, 7, or 8");
                return VariableValue();
            }

            uart_word_length_t word_length = UART_DATA_5_BITS;
            if (data_bits == 5) word_length = UART_DATA_5_BITS;
            else if (data_bits == 6) word_length = UART_DATA_6_BITS;
            else if (data_bits == 7) word_length = UART_DATA_7_BITS;
            else if (data_bits == 8) word_length = UART_DATA_8_BITS;

            uart_parity_t parity_mode = UART_PARITY_DISABLE;
            if (parity == 0) parity_mode = UART_PARITY_DISABLE;
            else if (parity == 1) parity_mode = UART_PARITY_EVEN;
            else if (parity == 2) parity_mode = UART_PARITY_ODD;

            uart_stop_bits_t stop_bits_mode = UART_STOP_BITS_1;
            if (stop_bits == 1) stop_bits_mode = UART_STOP_BITS_1;
            else if (stop_bits == 2) stop_bits_mode = UART_STOP_BITS_2;
            else if (stop_bits == 15) stop_bits_mode = UART_STOP_BITS_1_5;

            uart_config_t uart_config = {
                .baud_rate = baud_rate,
                .data_bits = word_length,
                .parity = parity_mode,
                .stop_bits = stop_bits_mode,
                .flow_ctrl = UART_HW_FLOWCTRL_DISABLE,
                .rx_flow_ctrl_thresh = 122,
                .source_clk = UART_SCLK_DEFAULT,
            };

            esp_err_t ret = uart_param_config(uart_num, &uart_config);
            
            // 更新对象属性
            thisValue->implement.objectImpl["baudRate"] = CreateNumberVariable(baud_rate);
            thisValue->implement.objectImpl["dataBits"] = CreateNumberVariable(data_bits);
            thisValue->implement.objectImpl["parity"] = CreateNumberVariable(parity);
            thisValue->implement.objectImpl["stopBits"] = CreateNumberVariable(stop_bits);

            return CreateBooleanVariable(ret == ESP_OK);
        });

    // 获取当前配置
    SerialObjectFuncTemplate["getConfig"] = VM::CreateSystemFunc(
        0,
        [](std::vector<VariableValue>& args, VMObject* thisValue,
           VMWorker* currentWorker) -> VariableValue {
            
            VMObject* configObj = currentWorker->VMInstance->currentGC->GC_NewObject(
                ValueType::OBJECT);
            
            // 从对象属性获取配置
            auto& obj = thisValue->implement.objectImpl;
            configObj->implement.objectImpl["baudRate"] = obj["baudRate"];
            configObj->implement.objectImpl["dataBits"] = obj["dataBits"];
            configObj->implement.objectImpl["parity"] = obj["parity"];
            configObj->implement.objectImpl["stopBits"] = obj["stopBits"];
            configObj->implement.objectImpl["flowControl"] = obj["flowControl"];
            configObj->implement.objectImpl["txPin"] = obj["txPin"];
            configObj->implement.objectImpl["rxPin"] = obj["rxPin"];

            return CreateReferenceVariable(configObj);
        });

    // 关闭串口
    SerialObjectFuncTemplate["close"] = VM::CreateSystemFunc(
        0,
        [](std::vector<VariableValue>& args, VMObject* thisValue,
           VMWorker* currentWorker) -> VariableValue {
            
