xy660/NexusEJS/src/NexusEJS-Firmware/src/ESP32Driver/ESP32_Driver_Serial.cpp
            uint32_t instanceId =
                (uint32_t)thisValue->implement.objectImpl["_id"].content.number;

            if (serialInstances.find(instanceId) != serialInstances.end()) {
                serial_delete(serialInstances[instanceId]);
                serialInstances.erase(instanceId);
            }
            
            if (serialQueues.find(instanceId) != serialQueues.end()) {
                vQueueDelete(serialQueues[instanceId]);
                serialQueues.erase(instanceId);
            }

            return CreateBooleanVariable(true);
        });
}

void ESP32_Serial_Init(VM* VMInstance) {
    VMObject* serialClass = VMInstance->currentGC->GC_NewObject(ValueType::OBJECT);

    Serial_ObjectFuncTemplateInit();

    // 初始化串口（简单版本）
    serialClass->implement.objectImpl["init"] = VM::CreateSystemFunc(
        DYNAMIC_ARGUMENT,
        [](std::vector<VariableValue>& args, VMObject* thisValue,
           VMWorker* currentWorker) -> VariableValue {
            
            if (args[0].getContentType() != ValueType::NUM ||
                args[1].getContentType() != ValueType::NUM ||
                args[2].getContentType() != ValueType::NUM) {
                currentWorker->ThrowError(
                    "Invalid argument type: expected (txPin, rxPin, baudRate)");
                return VariableValue();
            }

            int tx_pin = (int)args[0].content.number;
            int rx_pin = (int)args[1].content.number;
            int baud_rate = (int)args[2].content.number;

            // 默认参数
            int data_bits = 8;
            int parity = 0; // 0: none, 1: even, 2: odd
            int stop_bits = 1;
            int flow_control = 0; // 0: none, 1: RTS, 2: CTS, 3: RTS|CTS

            // 可选参数
            if (args.size() > 3 && args[3].getContentType() == ValueType::NUM) {
                data_bits = (int)args[3].content.number;
            }
            if (args.size() > 4 && args[4].getContentType() == ValueType::NUM) {
                parity = (int)args[4].content.number;
            }
            if (args.size() > 5 && args[5].getContentType() == ValueType::NUM) {
                stop_bits = (int)args[5].content.number;
            }
            if (args.size() > 6 && args[6].getContentType() == ValueType::NUM) {
                flow_control = (int)args[6].content.number;
            }


            // 确定使用哪个UART端口（ESP32有3个UART）
            uart_port_t uart_port = UART_NUM_0;
            if (rx_pin == 16 || tx_pin == 17) {
                uart_port = UART_NUM_2;  // UART2通常使用GPIO16(RX), GPIO17(TX)
            } else if (rx_pin == 32 || tx_pin == 33) {
                uart_port = UART_NUM_1;  // UART1通常使用GPIO32(RX), GPIO33(TX)
            } else {
                uart_port = UART_NUM_0;  // 默认使用UART0
            }
            
            // 转换参数
            uart_word_length_t word_length = UART_DATA_8_BITS;
            if (data_bits == 5) word_length = UART_DATA_5_BITS;
            else if (data_bits == 6) word_length = UART_DATA_6_BITS;
            else if (data_bits == 7) word_length = UART_DATA_7_BITS;
            
            uart_parity_t parity_mode = UART_PARITY_DISABLE;
            if (parity == 1) parity_mode = UART_PARITY_EVEN;
            else if (parity == 2) parity_mode = UART_PARITY_ODD;
            
            uart_stop_bits_t stop_bits_mode = UART_STOP_BITS_1;
            if (stop_bits == 2) stop_bits_mode = UART_STOP_BITS_2;
            else if (stop_bits == 15) stop_bits_mode = UART_STOP_BITS_1_5;
            
            uart_hw_flowcontrol_t flow_control_mode = UART_HW_FLOWCTRL_DISABLE;
            if (flow_control == 1) flow_control_mode = UART_HW_FLOWCTRL_RTS;
            else if (flow_control == 2) flow_control_mode = UART_HW_FLOWCTRL_CTS;
            else if (flow_control == 3) flow_control_mode = UART_HW_FLOWCTRL_CTS_RTS;

            // 初始化串口
            bool success = serial_port_init(uart_port, tx_pin, rx_pin, baud_rate, 
                           word_length, parity_mode, stop_bits_mode, 
                           flow_control_mode);

            if(!success){
                currentWorker->ThrowError("Serial.init failed");
                return VariableValue();
            }

            // 创建Serial对象
            VMObject* serialObject =
                currentWorker->VMInstance->currentGC->GC_NewObject(
                    ValueType::OBJECT);

            serialObject->implement.objectImpl =
                SerialObjectFuncTemplate;  // 拷贝Serial内置成员到对象

            auto& objContainer = serialObject->implement.objectImpl;

            // 分配实例ID
            uint32_t instanceId = serialInstanceIdSeed++;
            objContainer["_id"] = CreateNumberVariable((double)instanceId);
            objContainer["txPin"] = CreateNumberVariable(tx_pin);
            objContainer["rxPin"] = CreateNumberVariable(rx_pin);
            objContainer["baudRate"] = CreateNumberVariable(baud_rate);
            objContainer["dataBits"] = CreateNumberVariable(data_bits);
            objContainer["parity"] = CreateNumberVariable(parity);
            objContainer["stopBits"] = CreateNumberVariable(stop_bits);
            objContainer["flowControl"] = CreateNumberVariable(flow_control);

            

            objContainer["_port"] = CreateNumberVariable((double)uart_port);

            
            
            

            // 存储实例
            serialInstances[instanceId] = uart_port;

            return CreateReferenceVariable(serialObject);
        });
        /*
    // 快速初始化（使用默认引脚）
    serialClass->implement.objectImpl["initDefault"] = VM::CreateSystemFunc(
        1,
        [](std::vector<VariableValue>& args, VMObject* thisValue,
           VMWorker* currentWorker) -> VariableValue {
            
            if (args[0].getContentType() != ValueType::NUM) {
                currentWorker->ThrowError(
                    "Invalid argument type: expected (baudRate)");
                return VariableValue();
            }

            int baud_rate = (int)args[0].content.number;
            
            // 默认使用UART0，GPIO1(TX), GPIO3(RX) - ESP32的默认串口引脚
            int tx_pin = 1;
            int rx_pin = 3;
            int data_bits = 8;
            int parity = 0;
            int stop_bits = 1;
            int flow_control = 0;

            VMObject* serialObject =
                currentWorker->VMInstance->currentGC->GC_NewObject(
                    ValueType::OBJECT);

            serialObject->implement.objectImpl = SerialObjectFuncTemplate;
            auto& objContainer = serialObject->implement.objectImpl;

            uint32_t instanceId = serialInstanceIdSeed++;
            objContainer["_id"] = CreateNumberVariable((double)instanceId);
            objContainer["txPin"] = CreateNumberVariable(tx_pin);
            objContainer["rxPin"] = CreateNumberVariable(rx_pin);
            objContainer["baudRate"] = CreateNumberVariable(baud_rate);
            objContainer["dataBits"] = CreateNumberVariable(data_bits);
            objContainer["parity"] = CreateNumberVariable(parity);
            objContainer["stopBits"] = CreateNumberVariable(stop_bits);
            objContainer["flowControl"] = CreateNumberVariable(flow_control);
            objContainer["_port"] = CreateNumberVariable((double)UART_NUM_0);

            // 初始化串口
            serial_port_init(UART_NUM_0, tx_pin, rx_pin, baud_rate, 
                           UART_DATA_8_BITS, UART_PARITY_DISABLE, 
                           UART_STOP_BITS_1, UART_HW_FLOWCTRL_DISABLE);

            serialInstances[instanceId] = UART_NUM_0;

            return CreateReferenceVariable(serialObject);
        });
        */

    std::string serialClassName = "Serial";
    auto serialClassRef = CreateReferenceVariable(serialClass);
    VMInstance->storeGlobalSymbol(serialClassName, serialClassRef);
}

#pragma endregion

#endif

#endif